In [1]:
import pandas as pd

In [5]:
data = {
    "FirstName": ["Alice", "Bob", "Charlie", "David", "Eve", "Frank", "Grace", "Hannah", "Ivy", "Jack"],
    "LastName": ["Smith", "Johnson", "Brown", "Taylor", "Anderson", "Thomas", "Martinez", "Harris", "Clark", "Lewis"]
}

In [6]:
df=pd.DataFrame(data)

In [7]:
df

  FirstName  LastName
0     Alice     Smith
1       Bob   Johnson
2   Charlie     Brown
3     David    Taylor
4       Eve  Anderson
5     Frank    Thomas
6     Grace  Martinez
7    Hannah    Harris
8       Ivy     Clark
9      Jack     Lewis

In [21]:
df['fullname']=df['FirstName']+' '+df['LastName']

In [22]:
df

  FirstName  LastName        fullname
0     Alice     Smith     Alice Smith
1       Bob   Johnson     Bob Johnson
2   Charlie     Brown   Charlie Brown
3     David    Taylor    David Taylor
4       Eve  Anderson    Eve Anderson
5     Frank    Thomas    Frank Thomas
6     Grace  Martinez  Grace Martinez
7    Hannah    Harris   Hannah Harris
8       Ivy     Clark       Ivy Clark
9      Jack     Lewis      Jack Lewis

In [10]:
del df['fulname']

In [20]:
df.drop(columns=['fullname'],inplace=True)

KeyError: "['fullname'] not found in axis"

In [19]:
df

  FirstName  LastName
0     Alice     Smith
1       Bob   Johnson
2   Charlie     Brown
3     David    Taylor
4       Eve  Anderson
5     Frank    Thomas
6     Grace  Martinez
7    Hannah    Harris
8       Ivy     Clark
9      Jack     Lewis

In [23]:
df['fullname'].str.split(' ',expand=True)

         0         1
0    Alice     Smith
1      Bob   Johnson
2  Charlie     Brown
3    David    Taylor
4      Eve  Anderson
5    Frank    Thomas
6    Grace  Martinez
7   Hannah    Harris
8      Ivy     Clark
9     Jack     Lewis

In [24]:
df[['f1','f2']]=df['fullname'].str.split(' ',expand=True)

In [27]:
df

  FirstName  LastName        fullname       f1        f2
0     Alice     Smith     Alice Smith    Alice     Smith
1       Bob   Johnson     Bob Johnson      Bob   Johnson
2   Charlie     Brown   Charlie Brown  Charlie     Brown
3     David    Taylor    David Taylor    David    Taylor
4       Eve  Anderson    Eve Anderson      Eve  Anderson
5     Frank    Thomas    Frank Thomas    Frank    Thomas
6     Grace  Martinez  Grace Martinez    Grace  Martinez
7    Hannah    Harris   Hannah Harris   Hannah    Harris
8       Ivy     Clark       Ivy Clark      Ivy     Clark
9      Jack     Lewis      Jack Lewis     Jack     Lewis

In [28]:
df.append({'f1':'hema'})

AttributeError: 'DataFrame' object has no attribute 'append'

In [29]:
df

  FirstName  LastName        fullname       f1        f2
0     Alice     Smith     Alice Smith    Alice     Smith
1       Bob   Johnson     Bob Johnson      Bob   Johnson
2   Charlie     Brown   Charlie Brown  Charlie     Brown
3     David    Taylor    David Taylor    David    Taylor
4       Eve  Anderson    Eve Anderson      Eve  Anderson
5     Frank    Thomas    Frank Thomas    Frank    Thomas
6     Grace  Martinez  Grace Martinez    Grace  Martinez
7    Hannah    Harris   Hannah Harris   Hannah    Harris
8       Ivy     Clark       Ivy Clark      Ivy     Clark
9      Jack     Lewis      Jack Lewis     Jack     Lewis

In [30]:
df.drop(index=9)

  FirstName  LastName        fullname       f1        f2
0     Alice     Smith     Alice Smith    Alice     Smith
1       Bob   Johnson     Bob Johnson      Bob   Johnson
2   Charlie     Brown   Charlie Brown  Charlie     Brown
3     David    Taylor    David Taylor    David    Taylor
4       Eve  Anderson    Eve Anderson      Eve  Anderson
5     Frank    Thomas    Frank Thomas    Frank    Thomas
6     Grace  Martinez  Grace Martinez    Grace  Martinez
7    Hannah    Harris   Hannah Harris   Hannah    Harris
8       Ivy     Clark       Ivy Clark      Ivy     Clark

In [31]:
df

  FirstName  LastName        fullname       f1        f2
0     Alice     Smith     Alice Smith    Alice     Smith
1       Bob   Johnson     Bob Johnson      Bob   Johnson
2   Charlie     Brown   Charlie Brown  Charlie     Brown
3     David    Taylor    David Taylor    David    Taylor
4       Eve  Anderson    Eve Anderson      Eve  Anderson
5     Frank    Thomas    Frank Thomas    Frank    Thomas
6     Grace  Martinez  Grace Martinez    Grace  Martinez
7    Hannah    Harris   Hannah Harris   Hannah    Harris
8       Ivy     Clark       Ivy Clark      Ivy     Clark
9      Jack     Lewis      Jack Lewis     Jack     Lewis

In [ ]:
df.dop(index=df[])